иб/src/Documents/НазначениеОтветственных/НазначениеОтветственных.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>НазначениеОтветственных</name>
  <attributes>
    <name>Ферма</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>10</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Корпус</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>10</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Пользователь</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>10</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <tabularSections>
    <name>Ответственные</name>
    <attributes>
      <name>Сектор</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>10</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Ответственный</name>
      <type>
        <types>CatalogRef.Сотрудники</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ОтветственныеПоСкладам</name>
    <attributes>
      <name>Склад</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>10</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Ответственный</name>
      <type>
        <types>CatalogRef.Сотрудники</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

иб/src/Documents/НазначениеОтветственных/ObjectModule.bsl
#Область ПроведениеДокумента

Процедура ОбработкаПроведения(Отказ, Режим)
	
	Движения.сжсвОтветственные.Записывать = истина;
	
	Для Каждого ТекСтрокаОтветственные Из Ответственные Цикл
		// регистр Ответственные 
		Движение = Движения.сжсвОтветственные.Добавить();
		Движение.Период = Дата;
		Движение.ОбъектОтветственности = ТекСтрокаОтветственные.Сектор;
		Движение.Ответственный = ТекСтрокаОтветственные.Ответственный;
	КонецЦикла;
	Для Каждого ТекСтрокаОтветственныеПоСкладам Из ОтветственныеПоСкладам Цикл
		// регистр Ответственные 
		Движение = Движения.сжсвОтветственные.Добавить();
		Движение.Период = Дата;
		Движение.ОбъектОтветственности = ТекСтрокаОтветственныеПоСкладам.Склад;
		Движение.Ответственный = ТекСтрокаОтветственныеПоСкладам.Ответственный;
	КонецЦикла;
	
КонецПроцедуры

#КонецОбласти
